In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

### Ayam

In [4]:
df_ayam = pd.read_excel('rerata_2019.xlsx','ayam')

In [5]:
df_ayam.head()

   Item  Qty
0  AYAM   50
1  AYAM   40
2  AYAM   50
3  AYAM   55
4  AYAM   60

In [10]:
df_ayam.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  94697.000000
mean      25.571496
std       17.268530
min        5.000000
25%       15.000000
50%       20.000000
75%       30.000000
max     1000.000000

### Crispy

In [11]:
df_crispy = pd.read_excel('rerata_2019.xlsx','crispy')

In [13]:
df_crispy.head()

                      Item  Qty
0  AYAM CRISPY (PARTING 9)    5
1  AYAM CRISPY (PARTING 9)    3
2  AYAM CRISPY (PARTING 9)    1
3  AYAM CRISPY (PARTING 9)    3
4  AYAM CRISPY (PARTING 9)    4

In [14]:
df_crispy.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

               Qty
count  9552.000000
mean      4.080611
std       6.730789
min       1.000000
25%       2.000000
50%       3.000000
75%       5.000000
max     500.000000

### Fillet

In [15]:
df_fillet = pd.read_excel('rerata_2019.xlsx','fillet')

In [16]:
df_fillet.head()

                       Item  Qty
0  AYAM FILLET (per 10 pcs)    1
1  AYAM FILLET (per 10 pcs)    2
2  AYAM FILLET (per 10 pcs)    2
3  AYAM FILLET (per 10 pcs)    2
4  AYAM FILLET (per 10 pcs)    3

In [17]:
df_fillet.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  16628.000000
mean       2.167669
std        2.138363
min        1.000000
25%        1.000000
50%        2.000000
75%        2.000000
max       40.000000

### Tahu

In [18]:
df_tahu = pd.read_excel('rerata_2019.xlsx','tahu')

In [19]:
df_tahu.head()

              Item  Qty
0  TAHU per 10 pcs   15
1  TAHU per 10 pcs    6
2  TAHU per 10 pcs    8
3  TAHU per 10 pcs    2
4  TAHU per 10 pcs    4

In [20]:
df_tahu.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  64380.000000
mean       2.827788
std        2.275574
min        1.000000
25%        1.000000
50%        2.000000
75%        3.000000
max       60.000000

### Tempe

In [22]:
df_tempe = pd.read_excel('rerata_2019.xlsx','tempe')

In [23]:
df_tempe.head()

               Item  Qty
0  TEMPE per 10 pcs   10
1  TEMPE per 10 pcs    6
2  TEMPE per 10 pcs    8
3  TEMPE per 10 pcs    2
4  TEMPE per 10 pcs    3

In [24]:
df_tempe.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  65117.000000
mean       2.628054
std        2.136403
min        1.000000
25%        1.000000
50%        2.000000
75%        3.000000
max       70.000000

### Sate Ati

In [25]:
df_ati = pd.read_excel('rerata_2019.xlsx','sate_ati')

In [26]:
df_ati.head()

                      Item  Qty
0  SATE ATI (per 10 Tusuk)    2
1  SATE ATI (per 10 Tusuk)    2
2  SATE ATI (per 10 Tusuk)    4
3  SATE ATI (per 10 Tusuk)    7
4  SATE ATI (per 10 Tusuk)    2

In [27]:
df_ati.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  47639.000000
mean       5.662797
std        7.517690
min        1.000000
25%        1.000000
50%        3.000000
75%       10.000000
max      150.000000

### Sate Usus

In [28]:
df_usus = pd.read_excel('rerata_2019.xlsx','sate_usus')

In [30]:
df_usus.head()

                       Item  Qty
0  SATE USUS (per 10 Tusuk)    2
1  SATE USUS (per 10 Tusuk)    2
2  SATE USUS (per 10 Tusuk)    4
3  SATE USUS (per 10 Tusuk)    5
4  SATE USUS (per 10 Tusuk)    3

In [32]:
df_usus.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  61673.000000
mean       6.503413
std        8.581288
min        1.000000
25%        1.000000
50%        3.000000
75%       10.000000
max      200.000000

### Sate Kulit

In [33]:
df_kulit = pd.read_excel('rerata_2019.xlsx', 'sate_kulit')

In [34]:
df_kulit.head()

                        Item  Qty
0  SATE KULIT (per 10 Tusuk)   10
1  SATE KULIT (per 10 Tusuk)    4
2  SATE KULIT (per 10 Tusuk)    6
3  SATE KULIT (per 10 Tusuk)    8
4  SATE KULIT (per 10 Tusuk)    3

In [35]:
df_kulit.describe()
# Minimal = 25%
# Ideal = 50%
# Maksimal = 75%
# Qty = Jumlah satuan per hari per cabang

                Qty
count  72915.000000
mean      13.458877
std       18.728893
min        1.000000
25%        2.000000
50%        5.000000
75%       20.000000
max     1000.000000